In [235]:
import numpy as np
import pandas as pd

In [236]:
indexes = ['Iran','b','c']
list_py = [10,20,30]
dic = {'a':10 , 'b':20 , 'c':30}

In [237]:
sample = pd.Series(list_py,indexes)

In [238]:
sample

Iran    10
b       20
c       30
dtype: int64

In [239]:
covid19_data = pd.Series(data = [2000,400,1220,587,54789], index = ['Iran' , 'Usa' , 'India' , 'China' , 'France'])

In [240]:
covid19_data * 2

Iran        4000
Usa          800
India       2440
China       1174
France    109578
dtype: int64

In [241]:
covid19_data + sample

China        NaN
France       NaN
India        NaN
Iran      2010.0
Usa          NaN
b            NaN
c            NaN
dtype: float64

In [242]:
columns = ['Q','W','E','R','T']

In [243]:
index = ['A','B','C','D']

In [244]:
data = np.random.randint(-100 , 100 ,  (4,5))

In [245]:
data

array([[-16,  71, -53, -74,  38],
       [-12,  24,  -1, -54, -49],
       [ 83,  38,  -3,  80,  -8],
       [ 88,   8, -56, -69,  89]])

In [246]:
df = pd.DataFrame(data,index,columns)

In [247]:
df

    Q   W   E   R   T
A -16  71 -53 -74  38
B -12  24  -1 -54 -49
C  83  38  -3  80  -8
D  88   8 -56 -69  89

In [248]:
type(df)

pandas.core.frame.DataFrame

In [249]:
df['W']

A    71
B    24
C    38
D     8
Name: W, dtype: int32

In [250]:
type(df['Q'])

pandas.core.series.Series

In [251]:
df['new columns'] = df['Q'] + df["W"]

In [252]:
df

    Q   W   E   R   T  new columns
A -16  71 -53 -74  38           55
B -12  24  -1 -54 -49           12
C  83  38  -3  80  -8          121
D  88   8 -56 -69  89           96

In [253]:
df.drop('Q', axis = 1)

    W   E   R   T  new columns
A  71 -53 -74  38           55
B  24  -1 -54 -49           12
C  38  -3  80  -8          121
D   8 -56 -69  89           96

In [254]:
df

    Q   W   E   R   T  new columns
A -16  71 -53 -74  38           55
B -12  24  -1 -54 -49           12
C  83  38  -3  80  -8          121
D  88   8 -56 -69  89           96

In [255]:
df = df.drop('Q',axis=1)

In [256]:
df

    W   E   R   T  new columns
A  71 -53 -74  38           55
B  24  -1 -54 -49           12
C  38  -3  80  -8          121
D   8 -56 -69  89           96

In [257]:
df.loc['A']

W              71
E             -53
R             -74
T              38
new columns    55
Name: A, dtype: int32

In [258]:
type(df.loc[['A','B']])

pandas.core.frame.DataFrame

In [259]:
df.loc[["A","B"]]

    W   E   R   T  new columns
A  71 -53 -74  38           55
B  24  -1 -54 -49           12

In [260]:
df_new = df.drop('A')

In [261]:
df_new

    W   E   R   T  new columns
B  24  -1 -54 -49           12
C  38  -3  80  -8          121
D   8 -56 -69  89           96

In [262]:
df.iloc[0:2,2:]

    R   T  new columns
A -74  38           55
B -54 -49           12

In [263]:
df.loc[['A','B'],['W','new columns']]

    W  new columns
A  71           55
B  24           12

In [264]:
df.iloc[-1:,-1:]

   new columns
D           96

In [265]:
df.iloc[-1:]

   W   E   R   T  new columns
D  8 -56 -69  89           96

In [266]:
df

    W   E   R   T  new columns
A  71 -53 -74  38           55
B  24  -1 -54 -49           12
C  38  -3  80  -8          121
D   8 -56 -69  89           96

In [267]:
df >= 0

      W      E      R      T  new columns
A  True  False  False   True         True
B  True  False  False  False         True
C  True  False   True  False         True
D  True  False  False   True         True

In [268]:
df[df >= 0]

    W   E     R     T  new columns
A  71 NaN   NaN  38.0           55
B  24 NaN   NaN   NaN           12
C  38 NaN  80.0   NaN          121
D   8 NaN   NaN  89.0           96

In [269]:
df[df['W'] > 0].iloc[:1]

    W   E   R   T  new columns
A  71 -53 -74  38           55

In [270]:
df.columns

Index(['W', 'E', 'R', 'T', 'new columns'], dtype='object')

In [271]:
df[(df['W'] > 1) & (df['new columns'] >= 0)]

    W   E   R   T  new columns
A  71 -53 -74  38           55
B  24  -1 -54 -49           12
C  38  -3  80  -8          121
D   8 -56 -69  89           96

In [272]:
df.reset_index()

  index   W   E   R   T  new columns
0     A  71 -53 -74  38           55
1     B  24  -1 -54 -49           12
2     C  38  -3  80  -8          121
3     D   8 -56 -69  89           96

In [273]:
index_states = ['Bastam', 'Shahrood', 'Bonab', 'Tabriz']

In [274]:
df['States'] = index_states

In [275]:
df = df.set_index('States')

In [276]:
df

           W   E   R   T  new columns
States
Bastam    71 -53 -74  38           55
Shahrood  24  -1 -54 -49           12
Bonab     38  -3  80  -8          121
Tabriz     8 -56 -69  89           96

In [277]:
df.describe()

               W          E          R          T  new columns
count   4.000000   4.000000   4.000000   4.000000     4.000000
mean   35.250000 -28.250000 -29.250000  17.500000    71.000000
std    26.800187  30.346609  73.327462  59.455866    47.826074
min     8.000000 -56.000000 -74.000000 -49.000000    12.000000
25%    20.000000 -53.750000 -70.250000 -18.250000    44.250000
50%    31.000000 -28.000000 -61.500000  15.000000    75.500000
75%    46.250000  -2.500000 -20.500000  50.750000   102.250000
max    71.000000  -1.000000  80.000000  89.000000   121.000000

In [278]:
df.dtypes

W              int32
E              int32
R              int32
T              int32
new columns    int32
dtype: object

In [279]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Bastam to Tabriz
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   W            4 non-null      int32
 1   E            4 non-null      int32
 2   R            4 non-null      int32
 3   T            4 non-null      int32
 4   new columns  4 non-null      int32
dtypes: int32(5)
memory usage: 112.0+ bytes

In [280]:
df

           W   E   R   T  new columns
States
Bastam    71 -53 -74  38           55
Shahrood  24  -1 -54 -49           12
Bonab     38  -3  80  -8          121
Tabriz     8 -56 -69  89           96

In [295]:
df['E'][2] = np.nan
df['E'][3] = np.nan
df['W'][0] = np.nan
df['W'][1] = np.nan
df['W'][2] = np.nan

C:\Users\Yasin\AppData\Local\Temp\ipykernel_4332\1910374095.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['E'][2] = np.nan
C:\Users\Yasin\AppData\Local\Temp\ipykernel_4332\1910374095.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['E'][3] = np.nan
C:\Users\Yasin\AppData\Local\Temp\ipykernel_4332\1910374095.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['W'][0] = np.nan
C:\Users\Yasin\AppData\Local\Temp\ipykernel_4332\1910374095.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['W'][1] = np.nan
C:\Users\Yasin\AppData\Local\Temp\ipykernel_4332\1910374095.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['W'][2] = np.nan

In [296]:
df

            W     E   R   T  new columns
States
Bastam    NaN -53.0 -74  38           55
Shahrood  NaN  -1.0 -54 -49           12
Bonab     NaN   NaN  80  -8          121
Tabriz    8.0   NaN -69  89           96

In [283]:
# axis = 1 means delete column 
# thresh means at least valid data in any coulmn need to not delete
df.dropna(axis=1, thresh = 2)

             E   R   T  new columns
States
Bastam   -53.0 -74  38           55
Shahrood  -1.0 -54 -49           12
Bonab      NaN  80  -8          121
Tabriz     NaN -69  89           96

In [284]:
df.fillna(value = 'unavailable')

                    W            E   R   T  new columns
States
Bastam    unavailable        -53.0 -74  38           55
Shahrood  unavailable         -1.0 -54 -49           12
Bonab     unavailable  unavailable  80  -8          121
Tabriz            8.0  unavailable -69  89           96

In [306]:
df['E'] = df['E'].fillna(value=df['E'].mean())

In [307]:
df

            W     E   R   T  new columns
States
Bastam    NaN -53.0 -74  38           55
Shahrood  NaN  -1.0 -54 -49           12
Bonab     NaN -27.0  80  -8          121
Tabriz    8.0 -27.0 -69  89           96

In [308]:
df['W'] = df['W'].fillna(value = 0 )

In [309]:
df

            W     E   R   T  new columns
States
Bastam    0.0 -53.0 -74  38           55
Shahrood  0.0  -1.0 -54 -49           12
Bonab     0.0 -27.0  80  -8          121
Tabriz    8.0 -27.0 -69  89           96